import React from 'react';
import './extra_info.css';

const TermsOfUsePage: React.FC = () => {
    return (
        <div>
            <h1>Пользовательское соглашение сайта</h1>
            <pre style={{ whiteSpace: 'pre-wrap' }}>
                {`
*ссылка на сайт*

До того, как Вы начнете пользоваться сайтом (далее «Сайт»), сервисами и возможностями,
представленными на нем, просим Вас внимательно ознакомиться с настоящим документом. Используя
любые функции, сервисы и возможности Сайта, в том числе просто просматривая страницы Сайта, Вы
пользователь независимо от того, зарегистрировались ли Вы на Сайте или посещаете его без
регистрации, заявляете, что прочитали, поняли и согласны соблюдать настоящее пользовательское
соглашение (далее – «Соглашение»), включая все упомянутые в нем специальные условия и правила, без
каких-либо изъятий и оговорок.

Основные понятия, используемые в настоящем пользовательском соглашении

В настоящем пользовательском соглашении, если из текста настоящего соглашения прямо не вытекает
иное, следующие слова и выражения будут иметь указанные ниже значения:

• «Пользователь» – любое физическое лицо и/или юридическое лицо, в том числе посетитель Сайта,
принимающий условия настоящего Соглашения.

• «Администратор» – группа студентов колледжа Вятского Государственного университета.

• «Интернет-сайт» или «Сайт» – это совокупность программных и аппаратных средств для ЭВМ,
автоматизированная информационная система, доступная в сети Интернет по сетевому адресу.
Интернет-сайт принадлежит Администратору.

• «Сервис» — это программное обеспечение, доступное на Сайте, позволяющее Пользователю использовать
предусмотренный для него функционал. Сервис включает в себя интерфейс, программное обеспечение и
иные элементы (инструменты, алгоритмы, способы), необходимые для надлежащего функционирования
Сайта. Ни одно из положений Договора не может трактоваться как передача исключительных прав на
Сервис (его отдельные элементы) Пользователю.

• «Приложения Администратора» — информационные услуги и Сервисы, предоставляемые посредством
Сайта.

1. Общие положения

1.1. Настоящее пользовательское соглашение (далее по тексту – «Соглашение») определяет условия для
доступа и использования Сайта, мобильных версий Сайта, мобильных приложений и иных интернет-
порталов, принадлежащих Администратору, управляемых Администратором, доступ к которым
предоставляет Администратор.

1.2. Настоящий документ является юридически обязывающим соглашением между Вами как
Пользователем (Пользователями) Сайта и Администратором, заключающим Соглашение.

1.3. Соглашение является публичной офертой в соответствии со ст. 435 и п. 2 ст. 437 Гражданского кодекса
Российской Федерации.

1.4. Начиная использовать Сайт и/или его отдельные функции, Приложения Администратора, либо пройдя
процедуру регистрации Пользователем на Сайте, Пользователь считается принявшим условия Соглашения
в полном объеме, без всяких оговорок и исключений.

1.5. Соглашение, заключаемое путем акцепта настоящей оферты, не требует двустороннего подписания и
действительно в электронном виде.

1.6. Администратор предлагает Пользователю сети Интернет использовать Сайт на условиях, изложенных
в настоящем Соглашении. Соглашение вступает в силу с момента выражения Пользователем согласия с его
условиями в порядке, предусмотренном п. 1.4 и 1.5 Соглашения.

1.7. В случае несогласия с Соглашением Пользователь обязан немедленно прекратить использование Сайта
и покинуть его.

1.8. Использование Сайта регулируется настоящим Соглашением, а также документами, которые являются
неотъемлемой частью Соглашения.

1.9. Соглашение может быть изменено Администратором без какого-либо специального уведомления.
Новая редакция Соглашения вступает в силу с момента его опубликования на Сайте. Пользователь
обязуется при каждом посещении Сайта знакомиться с содержанием Соглашения, размещенного на Сайте,
в целях своевременного ознакомления с его изменениями. Продолжение использования Приложения и/или
Сайта после внесения изменений в настоящее Соглашение означает согласие Пользователя с такими
изменениями.

1.10. Соглашаясь с условиями настоящего Соглашения, Пользователь подтверждает достоверность
предоставляемых им данных в рамках настоящего Соглашения и принимает на себя всю ответственность
за их точность, полноту и достоверность.

2. Предмет Соглашения

2.1. Администратор оказывает Пользователю услуги по предоставлению доступа к сервисам Сайта, при
этом обязательным условием оказания Администратором услуг в соответствии с настоящим Соглашением
является принятие, соблюдение Пользователем и применение к отношениям Сторон требований и
положений, определенных настоящим Соглашением.

3. Условия оказания услуг

3.1. Договор оказания услуг считается заключенным между Администратором и Пользователем с момента
начала использования Сайта или отдельных Сервисов Администратора Сайта.

3.2. В Приложениях Администратора могут быть представлены бесплатные услуги, которыми может
воспользоваться Пользователь. Услуги предоставляются Администратором. Условия получения тех или
иных услуг размещены в специальных разделах интерфейса Сайта. Перед началом использования
соответствующего Сервиса Администратора Пользователь обязуется внимательно знакомиться с
правилами и условиями получения соответствующей услуги. В случае несогласия с условиями получения
соответствующей услуги и/или Соглашения Пользователь должен воздержаться от использования
соответствующего Приложения Администратора и/или Сервиса.

3.3. Пользователь согласен с тем, что Администратор вправе в любое время расширить, ограничить,
изменить перечень бесплатных услуг Администратора.

4. Регистрация на Сайте

4.1. В целях пользования услугами, предоставляемыми Администратором по настоящему Соглашению,
Пользователь должен пройти обязательную процедуру регистрации на Сайте по адресу *. Регистрация
Пользователя на Сайте является бесплатной, добровольной.

4.2. При регистрации на Сайте Пользователь обязан предоставить Администратору необходимую
достоверную и актуальную информацию для формирования Профиля, включая уникальные для каждого
Пользователя логин (адрес электронной почты) и пароль доступа к Сайту, а также фамилию и имя и другие
данные. Регистрационная форма Сайта может запрашивать у Пользователя дополнительную информацию.

4.3. По завершении процесса регистрации Пользователь становится обладателем Учетной информации
Пользователя, что означает, что он несет ответственность за безопасность Учетной информации, а также за
все, что будет сделано на Сайте под Учетной информацией Пользователя. Пользователь обязан немедленно
уведомить Администратора о любом случае несанкционированного доступа к Сайту, то есть
осуществленного третьим лицом без согласия и ведома Пользователя и/или о любом нарушении
безопасности Учетной информации Пользователя. Администратор не несет ответственности за возможную
потерю или порчу данных, которая может произойти из-за нарушения Пользователем положений
настоящего пункта Соглашения.

4.4. Для начала работы с Сайтом Пользователь должен ввести в соответствующем разделе Сайта свою
Учетную информацию (логин и пароль).

4.5. Любые действия, совершенные с использованием логина и пароля Пользователя, считаются
совершенными соответствующим Пользователем. В случае несанкционированного доступа к логину и
паролю и/или Профилю Пользователя или распространения логина и пароля Пользователь обязан
незамедлительно сообщить об этом Администратора в установленном порядке.

5. Права и обязанности Администратора

5.1. Администратор вправе:

5.1.1 Устанавливать ограничения в использовании Сайта для всех Пользователей.

5.1.2 Направлять Пользователю информацию о развитии Сайта и его Сервисов. Посылать Пользователям
информационные сообщения. Используя Сайт, Пользователь также в соответствии с ч. 1 ст. 18
Федерального закона «О рекламе» дает свое согласие на получение сообщений рекламного характера.

5.1.3 Без согласования с Пользователем, переуступать либо каким-либо иным способом передавать свои
права и обязанности по исполнению Соглашения третьим лицам.

5.1.4 Изменять условия предоставления услуг, размещённых на Сайте, в одностороннем порядке без
согласия Пользователя, путём размещения таких изменений на Сайте.

5.1.5 Без предварительного уведомления Пользователя осуществлять ограничение отдельных действий
Пользователя, если такие действия создают угрозу для нормального функционирования Сайта.

5.1.6 Без предварительного уведомления Пользователя производить профилактические и/или ремонтные
работы, которые могут повлечь перерывы в работе Сайта.

5.1.7 Распоряжаться статистической информацией, связанной с функционированием Сайта.

5.1.8 В случае отзыва Пользователем или его представителем согласия на обработку персональных данных
в соответствии с пп. 6.3.7 настоящего Соглашения Администратор вправе продолжить обработку
персональных данных без согласия субъекта персональных данных (Пользователя) при наличии оснований,
указанных в пунктах 2–11 части 1 статьи 6, части 2 статьи 10 и части 2 статьи 11 Федерального закона от
27.07.2006 № 152-ФЗ «О персональных данных».

5.1.9 Для решения технических вопросов при определении вины Пользователя в результате его
неправомерных действий при пользовании сетью Интернет и Сайтом, в частности, Администратор вправе
самостоятельно привлекать компетентные организации в качестве экспертов. В случае установления вины
Пользователя последний обязан возместить затраты на проведение экспертизы.

5.1.10 Если Пользователь совершил или был заподозрен Администратором в совершении противоправных
действий, направленных на причинение убытков Администратору и/или третьим лицам, то Администратор
имеет право отказать в оказании услуг, регистрации личного кабинета или ином действии на Сайте.

5.1.11 Осуществляя регистрацию на Сайте или пользуясь соответствующим Сервисом на Сайте
Пользователь соглашается с тем, что Администратор вправе поручить исполнение договора оказания услуг,
заключенного между Администратором и Пользователем третьему лицу, при этом оставаясь
ответственным за его исполнение.

5.2. Администратор обязан:

5.2.1. Оказывать Пользователю услуги, указанные в пункте 2.1 настоящего Соглашения. Доступ к Сайту
предоставляется путем присвоения Пользователю Учетной информации в течение 5 (пяти) рабочих дней с
даты регистрации последнего по адресу *.

5.2.2. Предоставлять Пользователю возможность самостоятельно редактировать информацию о самом себе.

5.2.3. Не разглашать третьим лицам Учетную информацию Пользователя.

5.2.4. Обеспечивать круглосуточную доступность сервера, на котором расположен Сайт, за исключением
времени проведения профилактических и/или ремонтных работ.

6. Права и обязанности Пользователя

6.1. Пользователь обязуется:

6.1.1. Полностью ознакомиться с условиями настоящего Соглашения и соблюдать все условия настоящего
Соглашения.

6.1.5. Не использовать программное обеспечение и не осуществлять действия, направленные на нарушение
нормального функционирования Сайта, его Сервисов, персональных страниц (личных кабинетов
Пользователей).

6.1.6. Не загружать, не хранить, не публиковать, не распространять и не предоставлять доступ или иным
образом использовать вирусы, трояны и другие вредоносные программы.

6.1.7. Не использовать автоматизированные скрипты (программы) для сбора информации на Сайте и/или
взаимодействия с Сайтом и Приложениями Администратора.

6.1.8. Не пытаться получить доступ к логину и паролю другого Пользователя, в том числе включая, но не
ограничиваясь обманом, взломом личных кабинетов других Пользователем и пр.

6.1.9. Не осуществлять незаконное использование и копирование шаблонов Сайта.

6.1.10. Не регистрироваться в качестве Пользователя от имени или вместо другого лица.

6.1.11. До момента использования Сайта ознакомиться с содержанием и условиями настоящего
Соглашения.

6.2. Пользователю запрещено:

6.2.1. Нарушать права третьих лиц, размещая недостоверную информацию и другие данные.

6.2.2. Несанкционированно собирать и хранить персональные данные третьих лиц.

6.2.3. Выдавать себя за другого человека или представителя организации и/или сообщества без достаточных
на то прав, а также применять любые другие формы и способы незаконного представительства других лиц
в сети Интернет, а также вводить Пользователей или Администратора в заблуждение относительно свойств
и характеристик каких-либо субъектов или объектов.

6.2.4. Загружать, посылать, передавать или любым другим способом размещать и/или распространять
информацию на Сайте, при отсутствии прав на такие действия согласно законодательству Российской
Федерации или каким-либо договорным отношениям.

6.2.5. Загружать, посылать, передавать или любым другим способом размещать и/или распространять на
Сайте какие-либо материалы, содержащие вирусы или другие компьютерные коды, файлы или программы,
предназначенные для нарушения, уничтожения либо ограничения функциональности любого
компьютерного или телекоммуникационного оборудования, или программ, для осуществления
несанкционированного доступа к коммерческим программным продуктам, для размещения ссылок на
вышеуказанную информацию.

6.2.6. Изменять или создавать какие-либо производные приложения, производные произведения, составные
произведения на основе Сервисов и/или их элементов;

6.2.7. Декомпилировать, разбирать или каким-либо другим способом пытаться извлечь исходный код
программного обеспечения, являющегося элементом Сайта и/или Сервисов;

6.2.8. Распространять, продавать, сублицензировать, использовать программное обеспечение, являющееся
элементом Сайта и/или Сервисов, или каким-либо другим способом передавать права на такое программное
обеспечение;

6.2.9. Удалять или изменять любой торговый знак, логотип, знак охраны авторского права и прочие
уведомления о титулах, надписи, символы или знаки на Сайте, включая размещенные на нем информация
и материалы;

6.2.10. Копировать, транслировать, рассылать, публиковать или иным образом использовать информацию
и/или результаты интеллектуальной деятельности, размещенные на Сайте, без разрешения
Администратора;

6.2.11. Использовать ошибки программного обеспечения (и обязан незамедлительно сообщать о них
Администратору), вмешиваться в программный код, несанкционированно получать доступ К
компьютерной системе, получать, без надлежащего разрешения Администратора, доступ к Базам данных;

6.2.12. Передавать права и/или обязанности по настоящему Соглашению, в том числе передавать третьим
лицам право (возможность) использования Учетной информации;

6.2.13. Предпринимать какие-либо действия, направленные на нанесение ущерба Сайту, получение
несанкционированных возможностей (доступ) к Сайту;

6.2.14. Прибегать к взлому, попытке взлома и/или перехвату данных, поступающих к серверу или от
сервера;

6.2.15. Разглашать любую информацию о другом Пользователе; ограничивать доступ других Пользователей
к Сайту или препятствовать другим Пользователям в использовании Сервисов;

6.2.16. Осуществлять «перепродажу» предоставляемых Администратором Сервисов третьим лицам;

6.2.17. Осуществлять иные действия, направленные на извлечение коммерческой выгоды в отношениях с
третьими лицами из использования предоставляемых Администратором Сервисов;

6.2.18. Содействовать действиям, направленным на нарушение ограничений и запретов, налагаемых
Соглашением.

6.2.19. Другим образом нарушать нормы законодательства Российской Федерации, в том числе нормы
международного права.

6.3. Пользователь имеет право:

6.3.1. Круглосуточно получать доступ к Сайту, за исключением времени проведения плановых или
внеплановых, а также профилактических, ремонтных и иных видов работ или технических сбоев.

6.3.2. В случае возникновения вопросов и претензий со стороны Пользователя, он вправе обратиться к
Администратору по электронной почте support_kinomath@mail.ru или иным доступным способом.

6.3.3. Самостоятельно изменять пароль от личного кабинета, не уведомляя об этом Администратора.

6.3.4. Самостоятельно редактировать ранее размещенную о себе информацию на Сайте.

6.3.5. Обратиться в службу поддержки для блокирования своего личного кабинета.

6.3.6. Отозвать согласие на обработку персональных данных, предоставленное Пользователем в
соответствии с условиями настоящего Соглашения, путем направления Пользователем или его
представителем Администратора сканированной копии письменного заявления на отзыв согласия на
обработку персональных данных на электронную почту по следующему адресу:
support_kinomath@mail.ru.

6.4. Пользователь согласен с тем, что, осуществляя доступ к Сайту и пользуясь его Сервисом, он:

6.4.1. Выражает свое безоговорочное согласие со всеми условиями настоящего Соглашения и обязуется их
соблюдать или прекратить использование Сайта.

6.4.2. Получает право использовать Сервисы Сайта на одном компьютере, при условии, что ни сам
Пользователь, ни любые иные лица при содействии Пользователя не будут копировать или изменять
Сервис; программное обеспечение; создавать программы, производные от программного обеспечения;
проникать в программное обеспечение с целью получения кодов программ; осуществлять продажу,
уступку, сдачу в аренду, передачу третьим лицам в любой иной форме прав в отношении программного
обеспечения Сервисов, предоставляемых Сайтом.

6.4.3. Дает Администратору разрешение на использование, хранение, обработку и распространение
персональных данных тем способом и в той мере, в которых это необходимо для исполнения условий
настоящего Соглашения, а также на трансграничную передачу персональных данных в соответствии с
положениями статьи 12 Федерального закона от 27.07.2006 № 152-ФЗ «О персональных данных».
Пользователь соглашается на передачу третьим лицам персональных и иных данных, в том числе для целей
их обработки, для обеспечения функционирования Сайта и его отдельных Сервисов, реализации
партнерских и иных программах, при условии обеспечения в отношении передаваемых данных режима,
аналогичного режиму, существующему на Сайте, в том числе включая, но не ограничиваясь передачей
персональных данных лицам, аффилированным с Администратором или заключившим с ним договоры, а
также третьим лицам в случаях, когда такая передача необходима для использования Пользователем
определенного Сервиса Сайта либо для исполнения определенного соглашения или договора с
Пользователем. Обработка персональных данных осуществляется в соответствии с Политикой
Администратора в отношении обработки персональных данных.

6.4.4. Принимает настоящее Соглашение от имени юридического лица, от имени которого он вправе
действовать (например, компании-работодателя) и признает, что такое лицо является юридически
связанным условиями настоящего Соглашения (и что он обязуетесь поступать образом, соответствующим
настоящему Соглашению) или, если не существует такого лица, от имени которого Пользователь вправе
действовать, он принимаете настоящее Соглашение от своего имени как частное лицо и признаете, что он
юридически связан условиями настоящего Соглашения, и он заявляет и гарантирует, что он обладает
правом, полномочиями и правомочиями для того, чтобы выступать от имени такого лица и связывать его
условиями настоящего Соглашения (если применимо), либо связывать себя условиями настоящего
Соглашения. Пользователь не вправе принимать настоящее Соглашение от имени другого лица в случае,
если он не являетесь работником или иным законным представителем такого лица, обладающим правом,
полномочиями и правомочиями выступать от имени такого иного лица.

7. Исключительные права на Сайта и его Сервисы

7.1. Все объекты, доступные при помощи Сайта, в том числе элементы дизайна, текст, графические
изображения, иллюстрации, видео, программы для ЭВМ, базы данных, и другие объекты, а также любой
Сервис, размещенный на Сайте, являются объектами исключительных прав Администратора Сайта.

7.2. Использование Сервиса, а также каких-либо иных элементов Сайта возможно только в рамках
функционала Сайта. Никакие элементы содержания Сайта, а также любой Сервис, размещенный на Сайте,
не может быть использован иным образом без предварительного разрешения Администратора. Под
использованием подразумеваются, в том числе: воспроизведение, копирование, переработка,
распространение на любой основе, отображение во фрейме и т. д.

8. Политика конфиденциальности.

Мы высоко ценим ваш интерес к нашим Приложениям. Защита персональных данных для нас очень важна.
Мы соблюдаем правила защиты персональных данных и защиты ваших данных от несанкционированного
доступа третьих лиц (защита персональных данных).

Заполнение формы с контактными данными на сайте * означает безоговорочное согласие с настоящей
Политикой конфиденциальности и указанными в ней условиями обработки персональной информации.

Ниже приводится информация об обработке персональных данных.

8.1. Персональные данные. Цель сбора и обработки персональных данных.

8.1.1. Вы всегда можете посетить данную страницу, не раскрывая никакой персональной информации.

8.1.2. Под персональными данными понимается любая информация, относящаяся к определенному или
определяемому на основании такой информации физическому лицу.

8.1.3. Наша компания собирает и использует персональные данные, необходимые для выполнения Вашего
запроса, это имя, номер телефона, адрес электронной почты.

8.1.4. Мы не проверяем достоверность персональных данных, предоставляемых физическими лицами, и не
проверяем их дееспособность.

8.2. Условия обработки персональной информации покупателя и её передачи третьим лицам.

8.2.1. При обработке персональных данных посетителей сайта мы руководствуемся Федеральным законом
РФ «О персональных данных».

8.2.2. В отношении персональной информации заказчика сохраняется ее конфиденциальность.

8.2.3. Мы не передаем персональные данные третьим лицам.

8.3. Меры, применяемые для защиты персональной информации пользователей.

8.3.1 Мы принимаем необходимые и достаточные организационные и технические меры для защиты
персональной информации пользователя от неправомерного или случайного доступа, уничтожения,
изменения, блокирования, копирования, распространения, а также от иных неправомерных действий с ней
третьих лиц.

9. Согласие на обработку персональных данных Пользователя.

9.1. Регистрируясь на Сайте, Пользователь подтверждает свое согласие на обработку Администратором
Сайта своих персональных данных.

9.2. Администратор не несет ответственности, в случае незаконной передачи Пользователем
персональных данных третьего лица.

9.3. Перечень персональных данных Пользователя, на обработку которых дается согласие:

9.1.1. фамилия, имя, отчество;

9.1.2. телефон;

9.1.3. адрес электронной почты;

9.1.4. наименование организации, ИНН (при наличии);

9.1.5. почтовый адрес.

9.4. Согласие Пользователя на обработку персональных данных предоставляется без ограничения срока
его действия.

9.5. Пользователь, исключительно по личному заявлению, имеет право отозвать (изменить) настоящее
согласие на обработку персональных данных.

9.6. Администратор обрабатывает и обеспечивает конфиденциальность персональных данных в
соответствии с требованиями законодательства.

9.7. Администратор подтверждает, что персональные данные Пользователя, которые были указаны
Пользователем в момент оформления Подписки, будут использованы исключительно для исполнения
настоящего Договора.

9.8. Пользователь осведомлен и согласен, что телефонные разговоры с представителями Администратора
Сайта могут быть записаны в целях контроля качества их работы.

9.9. Администратор имеет право направлять Пользователю рекламные материалы и рассылки (в том числе
материалы партнеров) имеющие непосредственное отношение к настоящему Договору.

9.10. Пользователь имеет право отозвать свое согласие посредством составления соответствующего
письменного документа, который может быть направлен в адрес Администратора по почте заказным
письмом с уведомлением о вручении либо вручен лично под роспись представителю Администратора. В
случае получения письменного заявления об отзыве настоящего согласия на обработку персональных
данных Администратор обязана прекратить их обработку.

9.11. В результате сбоя, технических неисправностей, действий третьих лиц, в том числе (но не
ограничиваясь) вирусной или хакерской атаки, данные Пользователя могут стать доступны третьим лицам.
Пользователь осознает это и обязуется не предъявлять требований к Администратора о возмещении
убытков (ущерба), возникших в связи с этим.

9.12. Пользователь дает согласие на:

9.12.1. хранение персональных данных;

9.12.2. направления Пользователю информации об услугах, новостях Администратора и (или) партнеров
Администратора имеющей непосредственное отношение к настоящему Договору;

9.13. Администратор обрабатывает только данные, которые необходимы для исполнения настоящего
Соглашения.

10. Сайты и контент третьих лиц

10.1. Сайт может содержать ссылки на другие сайты в сети Интернет (сайты третьих лиц). Указанные третьи
лица и их контент не проверяются Администратором на соответствие тем или иным требованиям
(достоверности, полноты, законности и т.п.). Администратор не несет ответственность за любую
информацию, материалы, размещенные на сайтах третьих лиц, к которым Пользователь получает доступ с
использованием Сайта, в том числе, за любые мнения или утверждения, выраженные на сайтах третьих лиц,
рекламу и т.п., а также за доступность таких сайтов или контента и последствия их использования
Пользователем.

10.2. Размещенная на Сайте ссылка (в любой форме) на любой сайт, продукт, услугу, любую информацию
коммерческого или некоммерческого характера, не является одобрением или рекомендацией данных
продуктов (услуг, деятельности, товаров) со стороны Администратора, за исключением случаев, когда на
это прямо указывается на Сайте.

11. Ответственность Сторон

11.1. Пользователь самостоятельно определяет перечень организационных и программных (для ЭВМ)
средств для сохранения в тайне своей Учетной информации и обеспечения санкционированного доступа к
ней. Администратор не несет ответственность за убытки, причиненные Пользователю в результате
разглашения третьим лицам Учетной информации Пользователя. Если любое лицо, помимо Пользователя,
авторизуется на Сайте, используя Учетную информацию Пользователя, то все действия, совершенные
таким лицом, будут считаться совершенными этим Пользователем. Пользователь самостоятельно несет
ответственность за все действия, совершенные им на Сайте, а также за все действия, совершенные на Сайте
любыми иными лицами с использованием Учетной информации Пользователя.

11.2. Администратор не гарантирует, что программное обеспечение Сайта не содержит ошибок и/или
компьютерных вирусов или посторонних фрагментов кода. Администратор предоставляет возможность
Пользователю пользоваться программным обеспечением Сайта «как оно есть», без каких-либо гарантий со
стороны Администратора.

11.3. Администратор не гарантирует, что: Сайт соответствует/будет соответствовать требованиям
Пользователя; Сайт будет предоставляться непрерывно, быстро, надежно и без ошибок; результаты,
которые могут быть получены с использованием Сайта, будут точными и надежными и могут
использоваться для каких-либо целей или в каком-либо качестве (например, для установления и/или
подтверждения каких-либо фактов); качество какого-либо сервиса, услуги, информации и пр., полученных
с использованием Сайта, будет соответствовать ожиданиям Пользователя.

11.4. Администратор прилагает все возможные усилия для обеспечения нормальной работоспособности
Сайта, однако не несет ответственности за неисполнение или ненадлежащее исполнение обязательств по
Соглашению, а также возможные убытки, возникшие в том числе, но не ограничиваясь, в результате:

— неправомерных действий Пользователей, направленных на нарушения информационной безопасности
или нормального функционирования Сайта;

— сбоев в работе Сайта, вызванных ошибками в коде, компьютерными вирусами и иными посторонними
фрагментами кода в программном обеспечении Сайта;

— отсутствия (невозможности установления, прекращения и пр.) интернет-соединений между сервером
Пользователя и сервером Сайта;

— проведения государственными и муниципальными органами, а также иными организациями мероприятий
в рамках Системы оперативно-розыскных мероприятий;

— установления государственного регулирования (или регулирования иными организациями)
хозяйственной деятельности коммерческих организаций в сети Интернет и/или установления указанными
субъектами разовых ограничений, затрудняющих или делающих невозможным исполнение Соглашения;

— других случаев, связанных с действиями (бездействием) Пользователей и/или других субъектов,
направленными на ухудшение общей ситуации с использованием сети Интернет и/или компьютерного
оборудования, существовавшей на момент заключения Соглашения, а также любых других действий,
направленных на Сайт и на третьих лиц;

— выполнения работ, указанных в пунктах 12.5 и 12.6 настоящего Соглашения.

11.5. Администратор имеет право производить профилактические работы в программно-аппаратном
комплексе Сайта с временным приостановлением работы Сайта по возможности в ночное время и
максимально сокращая время неработоспособности Сайта.

11.6. В случае наступления форс-мажорных обстоятельств, а также аварий или сбоев в программно-
аппаратных комплексах третьих лиц, сотрудничающих с Администратором, или действий (бездействия)
третьих лиц, направленных на приостановку или прекращение функционирования Сайта, возможна
приостановка работы Сайта без предварительного уведомления Пользователя.

11.7. Администратор не несет ответственности за любые виды убытков, произошедшие вследствие
использования Пользователем Сервисов Сайта.

11.8. Администратор не несет ответственности за точность и правильность информации, предоставляемой
Пользователем при регистрации.

11.9. Пользователь самостоятельно несет ответственность за безопасность (в том числе устойчивость к
угадыванию) выбранных им средств для доступа к личному кабинету, а также самостоятельно обеспечивает
их конфиденциальность, а также за все действия, совершенные им на Сайте, а также за все действия,
совершенные на Сайте любыми иными лицами с использованием личного кабинета Пользователя.

11.10. Пользователь самостоятельно несет ответственность перед третьими лицами за свои действия,
связанные с использованием Сайта, в том числе, если такие действия приведут к нарушению прав и
законных интересов третьих лиц, а также за соблюдение законодательства Российской Федерации при
использовании Сайта.

11.11. В случае наступления форс-мажорных обстоятельств, а также аварий или сбоев в программно-
аппаратных комплексах третьих лиц, сотрудничающих с Администратором, или действий (бездействия)
третьих лиц, направленных на приостановку или прекращение функционирования Сайта, возможна
приостановка работы Сайта без предварительного уведомления Пользователя.

11.12. Администратор не несет ответственности за полное или частичное неисполнение любой из своих
обязанностей, если неисполнение является следствием таких обстоятельств, как наводнение, пожар,
землетрясение, другие стихийные бедствия, война или военные действия и другие обстоятельства
непреодолимой силы, возникшие после заключения Соглашения и не зависящие от воли Администратора.

11.13. Администратор не несет ответственности за прямые или косвенные убытки, возникшие у
Пользователя в связи с действиями третьих лиц, в том числе повлекших за собой неперечисление
(непоступление) или неполное перечисление (поступление) денежных средств на расчетный счет
Администратора, через электронные и иные системы платежей, в том числе в случае приобретения
Пользователем у третьих лиц, не уполномоченных Администратором, Сервисов либо осуществления в
адрес таких лиц Пользователем платежей в связи с использованием Сервисов.

11.14. Администратор прилагает все возможные усилия для обеспечения нормальной работоспособности
Сайта, однако не несет ответственности за неисполнение или ненадлежащее исполнение обязательств по
Соглашению, а также возможные убытки, возникшие в том числе, но не ограничиваясь, в результате:

12.14.1. Неправомерных действий Пользователей, направленных на нарушения информационной
безопасности или нормального функционирования Сайта;

12.14.2. Сбоев в работе Сайта, вызванных ошибками в коде, компьютерными вирусами и иными
посторонними фрагментами кода в программном обеспечении Сайта;

12.14.3. Отсутствия (невозможности установления, прекращения и пр.) Интернет-соединений между
сервером Пользователя и сервером Сайта;

12.14.4. Проведения государственными и муниципальными органами, а также иными организациями
мероприятий в рамках системы оперативно-розыскных мероприятий;

12.14.5. Установления государственного регулирования (или регулирования иными организациями)
хозяйственной деятельности коммерческих организаций в сети Интернет и/или установления указанными
субъектами разовых ограничений, затрудняющих или делающих невозможным исполнение Соглашения;

12.14.6. Других случаев, связанных с действиями (бездействием) Пользователей и/или других субъектов,
направленными на ухудшение общей ситуации с использованием сети Интернет и/или компьютерного
оборудования, существовавшей на момент заключения Соглашения, (а) также любых других действий,
направленных на Сайт и на третьих лиц.

11.15. В любом случае ответственность Администратора по любому из положений настоящего Соглашения
с Пользователем ограничивается суммой, фактически уплаченной за предоставленную услугу.

12. Срок действия Соглашения

12.1. Соглашение вступает в силу с момента ее акцепта Пользователем, и действует до момента отзыва
акцепта публичной оферты. В случае отзыва настоящего Соглашения, Соглашение считается
прекращенным с момента отзыва.

12.2. Администратор имеет право на отзыв оферты в соответствии со статьей 436 Гражданского Кодекса
Российской Федерации. В случае отзыва настоящего Соглашения Администратором Сайта настоящее
Соглашении считается прекращенным с момента отзыва. Отзыв осуществляется путем размещения
соответствующей информации на Сайте.

13. Порядок разрешения споров и урегулирования претензий

13.1. В случае возникновения споров между Пользователем и Администратором по вопросам, связанным с
исполнением Соглашения, Стороны примут все меры к разрешению их путем переговоров между собой.
Претензионный порядок разрешения споров обязателен. Претензии Пользователей по предоставляемым
Услугам принимаются и рассматриваются Администратором только в письменном виде и в порядке,
предусмотренном настоящим Соглашением и действующим законодательством РФ.

13.2. Для разрешения споров, возникших между Пользователем и Администратором в результате
использования услуг, применяется следующий претензионный порядок. Пользователь, считающий, что его
права нарушены из-за действий Администратора, направляет последнему претензию, содержащую суть
предъявляемого требования, обоснование его предъявления, а также все данные Пользователя. Претензия
также направляется Администратора в письменном виде посредством отправки по почте или по факсу; – в
течение 30 (тридцати) рабочих дней со дня получения претензии Администратор обязана изложить свою
позицию по указанным в ней принципиальным вопросам и направить свой ответ по адресу электронной
почты или почтовому адресу, указанному в претензии Пользователя; в случае недостижения разрешения
спора путем претензионного порядка спор подлежит рассмотрению в соответствии с пунктом 14.4
Соглашения; Администратором не рассматриваются анонимные претензии или претензии, не
позволяющие идентифицировать Пользователя на основе предоставленных им при регистрации данных,
или претензии, не содержащие данных, указанных в настоящем пункте настоящего Соглашения.

13.3. Для решения технических вопросов при определении вины Пользователя в результате его
неправомерных действий при пользовании сетью Интернет и Сайтом, в частности, Администратор вправе
самостоятельно привлекать компетентные организации в качестве экспертов. В случае установления вины
Пользователя последний обязан возместить затраты на проведение экспертизы.

13.4. При недостижении согласия между Сторонами путем переговоров спор, вытекающий из настоящего
Соглашения, подлежит рассмотрению в суде общей юрисдикции по месту нахождения Администратора.

14. Прочие условия

14.1. Настоящее Соглашение вступает в силу с момента акцепта настоящей оферты Пользователем и
заключается на неопределенный срок.

14.2. Настоящее Соглашение является офертой и в силу действующего гражданского законодательства РФ
Администратор имеет право на отзыв оферты в соответствии со статьей 436 Гражданского кодекса РФ. В
случае отзыва настоящего соглашения Администратором Сайта настоящее соглашение считается
прекращенным с момента отзыва. Отзыв осуществляется путем размещения соответствующей информации
на Сайте.

14.3. Положения настоящего Соглашения устанавливаются, изменяются и отменяются Администратором в
одностороннем порядке без предварительного уведомления. С момента размещения на Сайте новой
редакции Соглашения предыдущая редакция считается утратившей свою силу.

14.4. Если Пользователь не согласен с условиями настоящего Соглашения, то он должен немедленно
удалить свой Профиль с Сайта, в противном случае продолжение использования Пользователем означает,
что Пользователь согласен с условиями Соглашения.

14.5. Вопросы, не урегулированные настоящим Соглашением, подлежат разрешению в соответствии с
законодательством РФ.

15. Реквизиты Администратора Сайта

ГРУППА СТУДЕНТОВ КОЛЛЕДЖА ВЯТСКОГО ГОСУДАРСТВЕННОГО
УНИВЕРСИТЕТА «КИНОМАТCH»

ИНН 4346011035
КПП 434501001
УФК по Кировской области (ФГБОУ ВО "Вятский государственный университет", ВятГУ,
Вятский государственный университет, л/с 20406X65110)
ОТДЕЛЕНИЕ КИРОВ БАНКА РОССИИ//УФК по Кировской области г. Киров
БИК ТОФК: 013304182

ФГБОУ ВО «Вятский государственный университет»

Действующая редакция Соглашения от 01.02.2025 г.
        `}
            </pre>
        </div>
    );
};

export default TermsOfUsePage;